
var _ = require('underscore')

var Grammar = require('./Grammar').Grammar
var letter = require('./Word').word

var sentenceSetModule = require('./SentenceSet')
var word = sentenceSetModule.sentenceSet




var letters = [
    'っ',
    'ゃ',
    'ゅ',
    'ょ',
    'や',
    'よ',
    'わ',
    'ん',

    'あ',
    'い',
    'う',
    'え',
    'お',
    'か',
    'き',
    'く',
    'け',
    'こ',
    'が',
    'ぎ',
    'ぐ',
    'げ',
    'ご',
    'さ',
    'し',
    'す',
    'せ',
    'そ',
    'ざ',
    'じ',
    'ず',
    'ぜ',
    'ぞ',
    'た',
    'ち',
    'つ',
    'て',
    'と',
    'だ',
    'で',
    'ど',
    'な',
    'に',
    'ぬ',
    'ね',
    'の',
    'は',
    'ひ',
    'ふ',
    'へ',
    'ほ',
    // b
    'ば',
    'び',
    'ぶ',
    'べ',
    'ぼ',
    // p
    'ぱ',
    'ぴ',
    'ぷ',
    'ぺ',
    'ぽ',
    'ま',
    'み',
    'む',
    'め',
    'も',
    'ら',
    'り',
    'る',
    'ろ'
]


/*
new Grammar('smallTsu')
new Grammar('long')
new Grammar('smallYa').requires(や)
new Grammar('smallYu').requires(ゆ)
new Grammar('smallYo').requires(や)
*/
var words = [
    'すし', 'わさび', 'ひらがな', 'かたかな', 'かた', 'さむらい', 'せっぷく', 'はらきり', 'さよなら', 'こんにちは', 'まき', 'とうきょう', 'きょうと',
    'おおさか', 'にほん', 'にほんご', 'かみかぜ', 'ぼんさい', 'はいく', 'いけばな', 'かぶき', 'からおけ', 'まんが', 'おりがみ', 'おたく', 'きもの',
    'べんとう', 'じゅうどう', 'からて', 'けんどう', 'えだまめ', 'だいこん', 'ふぐ', 'ぎょうざ', 'きりん', 'いちばん', 'みそ', 'うどん', 'らめん',
    'のり', 'さしみ', 'しいたけ', 'そば', 'すきやき', 'てんぴら', 'てっぱんやき', 'うまみ', 'やきとり', 'しょうぐん', 'あいきどう', 'どうじょう',
    'じゅうじゅつ', 'すもう', 'ぜん', 'げいしゃ', 'ふとん', 'えもじ', 'かたな', 'かわいい', 'せんせい', 'しあつ', 'すうどく', 'すみません',
    'ありがとう', 'つなみ', 'しんかんせん', 'ぽけもん', 'りくしゃ', 'とよた', 'にっさん', 'たまごち', 'ばんざい', 'むらかみ', 'おの ようこ',
    'ひろしま', 'ふきしま', 'ふじ', 'くろさわ あきら', 'おび', 'げいしゃ', 'すずき', 'やまは', 'おんせん', 'さくら', 'とうふ',

    'て', 'まって', 'てあらい', 'でぐち', 'ちょっと', 'えび', 'ぎり', 'ずっと', 'けいざい', 'ぜったい', 'でる',
    'ざっか', 'ひと', 'ほね', 'です', 'できる', 'ねぎ'/*purjo*/, 'だめ', 'ある', 'なべ', 'ねこ', 'まねきねこ', 'うめ'/*name and plum*/,
    'そと', 'たっぷり', 'やっぱり',


    'びんぼう',
    'ひ',
    'ぎん',
    'ざらざら' /* rough, course */,
    'てら',
    'きっぷ',
    'だめ',
    'めちゃくちゃ',
    'ばば',
    'ほんとう',
    'ほほえむ',
    'たんぽぽ',

    'げろげろ'/* frog sound*/,

    'えびす', 'ぎふ', 'きゅうしゅう', 'なごや', 'しぶや', 'やまがた', 'よこはま', 'ひょうご', 'よしわら', 'みやぎ', 'ぐんま', 'かわぐち', 'さっぽろ', 'ほっかいどう', 'なごや',
    'にいがた', 'さっぽろ', 'あそ'/*mt aso = volcano*/, 'はこね',


    'ようこ', 'めぐみ',


    'ひろしげ',
    'さとう', 'たかはし', 'たなか', 'わたなべ', 'いとう', 'やまもと', 'なかむら', 'こばやし', 'かとう', 'よしだ', 'やまだ', 'ささき',
    'やまぐち', 'さいとう', 'まつもと', 'いのうえ', 'きむら', 'はやし', 'しみず', 'やまざき', 'もり', 'あべ', 'いけだ', 'はしもと',
    'やました', 'いしかわ', 'なかじま', 'まえだ', 'ふじた', 'ごとう', 'おかだ', 'はせがわ', 'さかもと', 'あおき', 'にしむら', 'ふくだ',
    'みうら', 'ふじわら', 'おかもと', 'まつだ', 'なかがわ', 'なかの', 'はらだ', 'たまうら', 'たけうち', 'かねこ', 'わだ', 'なかやま',
    'いしだ', 'うえだ', 'もりた', 'はら', 'さかい', 'よこやま', 'みやもと', 'うちだ', 'たかぎ', 'たにぐち', 'おうの', 'まるやま',
    'いまい', 'たかだ', 'ふじもと', 'たけだ', 'むらた', 'うえの', 'すぎやま', 'ますだ', 'すがわら', 'ひらの', 'こじま', 'おつか',
    'ちば', 'まつい', 'いわさき', 'さくらい', 'きのした', 'のぐち', 'まつお', 'のむら', 'きくち', 'すごもと', 'あらい'
]

var letterCounts = {}

_.forEach(words, function(word) {
    for (var i = 0; i < word.length; i++) {
        if (letterCounts[word[i]]) {
            letterCounts[word[i]]++
        }
        else {
            letterCounts[word[i]] = 1
        }
    }
})


_.forEach(letters, function(letter) {
    if (letterCounts[letter] < 20 && letterCounts[letter] > 10) {

    console.log(letter, letterCounts[letter])
    }
})

